# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'oven-sh/bun'
tap 'dart-lang/dart'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'grep'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'ffmpeg'

# Development
brew 'imagemagick'
brew 'php@8.3'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'bun'
brew 'cocoapods'
brew 'dart'

# Apps
cask 'alfred'
cask 'bartender'
cask 'google-chrome'
cask 'grammarly'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'adoptopenjdk'
cask 'phpstorm'
cask 'ray'
cask 'skype'
cask 'tableplus'
cask 'tinkerwell'
cask 'todoist'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'android-studio'
cask 'flutter'
cask 'spotify'
cask 'kaleidoscope'
cask 'adobe-creative-cloud'
cask 'whatsapp'
cask 'telegram'
cask 'termius'
cask 'teamviewer'
cask 'anydesk'
cask 'github'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-jetbrains-mono'
