# Taps
tap 'nicoverbruggen/homebrew-cask'
tap 'oven-sh/bun'
tap 'dart-lang/dart'

# Install Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gh'
brew 'grep'
brew 'mackup'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'ffmpeg'

# Modern CLI tools
brew 'eza'           # ls moderno
brew 'ripgrep'       # grep veloce
brew 'fd'            # find semplice
brew 'zoxide'        # cd smart
brew 'fnm'           # node version manager
brew 'git-delta'     # git diff visivi
brew 'bottom'        # htop moderno
brew 'fzf'           # fuzzy finder
brew 'jq'            # JSON processor
brew 'yq'            # YAML processor
brew 'direnv'        # env per directory
brew 'ncdu'          # disk usage interattivo
brew 'starship'      # prompt cross-shell

# Development
brew 'imagemagick'
brew 'php@8.3'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'bun'
brew 'cocoapods'
brew 'dart'

# Apps
cask 'setapp'
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'google-chrome'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'adoptopenjdk'
cask 'phpstorm'
cask 'tinkerwell'
cask 'todoist-app'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-word'
cask 'android-studio'
cask 'flutter'
cask 'spotify'
cask 'kaleidoscope'
cask 'adobe-creative-cloud'
cask 'whatsapp'
cask 'telegram'
cask 'termius'
cask 'tailscale'
cask 'winbox'
cask 'github'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-jetbrains-mono'
cask 'font-meslo-lg-nerd-font'
